



V6OPS Working Group                                             D. Binet
Internet-Draft                                              M. Boucadair
Intended status: Informational                            France Telecom
Expires: March 15, 2014                                        A. Vizdal
                                                     Deutsche Telekom AG
                                                                C. Byrne
                                                                T-Mobile
                                                                 G. Chen
                                                            China Mobile
                                                      September 11, 2013


 An Internet Protocol Version 6 (IPv6) Profile for 3GPP Mobile Devices
               draft-ietf-v6ops-mobile-device-profile-06

Abstract

   This document defines an IPv6 profile that a number of operators
   recommend in order to connect 3GPP mobile devices to an IPv6-only or
   dual-stack wireless network (including 3GPP cellular network and IEEE
   802.11 network).

   This document defines a different profile than the one for general
   connection to IPv6 cellular networks defined in
   [I-D.ietf-v6ops-rfc3316bis].  In particular, this document identifies
   also features to deliver IPv4 connectivity service over an IPv6-only
   transport.

   Both hosts and devices with capability to share their WAN (Wide Area
   Network) connectivity are in scope.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on March 15, 2014.




Binet, et al.            Expires March 15, 2014                 [Page 1]

Internet-Draft      IPv6 Profile for Cellular Devices     September 2013


Copyright Notice

   Copyright (c) 2013 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
     1.1.  Scope . . . . . . . . . . . . . . . . . . . . . . . . . .   4
     1.2.  Special Language  . . . . . . . . . . . . . . . . . . . .   4
   2.  Connectivity Requirements . . . . . . . . . . . . . . . . . .   5
     2.1.  WLAN Connectivity Requirements  . . . . . . . . . . . . .   8
   3.  Advanced Requirements . . . . . . . . . . . . . . . . . . . .   9
   4.  Cellular Devices with LAN Capabilities  . . . . . . . . . . .  10
   5.  APIs & Applications . . . . . . . . . . . . . . . . . . . . .  12
   6.  Security Considerations . . . . . . . . . . . . . . . . . . .  12
   7.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  13
   8.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  13
   9.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  13
     9.1.  Normative References  . . . . . . . . . . . . . . . . . .  13
     9.2.  Informative References  . . . . . . . . . . . . . . . . .  15

1.  Introduction

   IPv6 deployment in 3GPP mobile networks is the only perennial
   solution to the exhaustion of IPv4 addresses in those networks.
   Several mobile operators have already deployed IPv6 [RFC2460] or are
   in the pre-deployment phase.  One of the major hurdles encountered by
   mobile operators is the availability of non-broken IPv6
   implementation in mobile devices.

   [I-D.ietf-v6ops-rfc3316bis] lists a set of features to be supported
   by cellular hosts to connect to 3GPP mobile networks.  In the light
   of recent IPv6 production deployments, additional features to
   facilitate IPv6-only deployments while accessing IPv4-only service
   are to be considered.





Binet, et al.            Expires March 15, 2014                 [Page 2]

Internet-Draft      IPv6 Profile for Cellular Devices     September 2013


   This document defines a different profile than the one for general
   connection to IPv6 mobile networks defined in
   [I-D.ietf-v6ops-rfc3316bis]; in particular:

   o  It lists an extended list of features while
      [I-D.ietf-v6ops-rfc3316bis] identifies issues and explains how to
      implement basic IPv6 features in a cellular context.

   o  It identifies also features to ensure IPv4 service delivery over
      an IPv6-only transport.

   This document defines an IPv6 profile for mobile devices listing
   specifications produced by various Standards Developing Organizations
   (in particular 3GPP and IETF).  The objectives of this effort are:

   1.  List in one single document a comprehensive list of IPv6 features
       for a mobile device, including both IPv6-only and dual-stack
       mobile deployment contexts.  These features cover various network
       types such as GPRS (General Packet Radio Service), EPC (Evolved
       Packet Core) or IEEE 802.11 network.

   2.  Help Operators with the detailed device requirement list
       preparation (to be exchanged with device suppliers).  This is
       also a contribution to harmonize Operators' requirements towards
       device vendors.

   3.  Vendors to be aware of a set of features to allow for IPv6
       connectivity and IPv4 service continuity (over an IPv6-only
       transport).

   Pointers to some requirements listed in [RFC6434] are included in
   this profile.  The justification for using a stronger language
   compared to what is specified in [RFC6434] is provided for some
   requirements.

   The requirements do not include 3GPP release details.  For more
   information on the 3GPP releases detail, the reader may refer to
   Section 6.2 of [RFC6459].

   Some of the features listed in this profile document require to
   activate dedicated functions at the network side.  It is out of scope
   of this document to list these network-side functions.

   A detailed overview of IPv6 support in 3GPP architectures is provided
   in [RFC6459].

   This document makes use of the terms defined in [RFC6459].  In
   addition, the following terms are used:



Binet, et al.            Expires March 15, 2014                 [Page 3]

Internet-Draft      IPv6 Profile for Cellular Devices     September 2013


   o  "3GPP cellular host" (or cellular host for short) denotes a 3GPP
      device which can be connected to 3GPP mobile networks or IEEE
      802.11 networks.

   o  "3GPP cellular device" (or cellular device for short) refers to a
      cellular host which supports the capability to share its WAN (Wide
      Area Network) connectivity.

   o  "Cellular host" and "mobile host" are used interchangeably.

   o  "Cellular device" and "mobile device" are used interchangeably.

   PREFIX64 denotes an IPv6 prefix used to build IPv4-converted IPv6
   addresses [RFC6052].

1.1.  Scope

   A 3GPP mobile network can be used to connect various user equipments
   such as a mobile telephone, a CPE (Customer Premises Equipment) or a
   M2M (machine-to-machine) device.  Because of this diversity of
   terminals, it is necessary to define a set of IPv6 functionalities
   valid for any node directly connecting to a 3GPP mobile network.
   This document describes these functionalities.

   This document is structured to provide the generic IPv6 requirements
   which are valid for all nodes, whatever their function or service
   (e.g., SIP [RFC3261]) capability.  The document also contains
   sections covering specific functionalities for devices providing some
   LAN functions (e.g., mobile CPE or broadband dongles).

   The requirements listed below are valid for both 3GPP GPRS and 3GPP
   EPS (Evolved Packet System) access.  For EPS, PDN-Connection term is
   used instead of PDP-Context.

   This document identifies also some WLAN-related IPv6 requirements.
   Other non-3GPP accesses [TS.23402] are out of scope of this document.

1.2.  Special Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

      NOTE WELL: This document is not a standard, and conformance with
      it is not required in order to claim conformance with IETF
      standards for IPv6.  The support of the full set of features may
      not be required in some deployment contexts.  The authors believe
      that the support of a subset of the features included in this



Binet, et al.            Expires March 15, 2014                 [Page 4]

Internet-Draft      IPv6 Profile for Cellular Devices     September 2013


      protocol may lead to degraded level of service in some deployment
      contexts.

      This document uses the normative keywords only for precision.

2.  Connectivity Requirements

   REQ#1:  The cellular host MUST be compliant with Section 5.9.1 (IPv6
        Addressing Architecture) and Section 5.8 (ICMPv6 support) of
        [RFC6434].

   REQ#2:  The cellular host MUST support both IPv6 and IPv4v6 PDP-
        Contexts.

           This allows each operator to select their own strategy
           regarding IPv6 introduction.  Both IPv6 and IPv4v6 PDP-
           Contexts MUST be supported.  IPv4, IPv6 or IPv4v6 PDP-Context
           request acceptance depends on the cellular network
           configuration.

   REQ#3:  The cellular host MUST comply with the behavior defined in
        [TS.23060] [TS.23401] [TS.24008] for requesting a PDP-Context
        type.  In particular, the cellular host MUST request by default
        an IPv6 PDP-Context if the cellular host is IPv6-only and
        requesting an IPv4v6 PDP-Context if the cellular host is dual-
        stack or when the cellular host is not aware of connectivity
        types requested by devices connected to it (e.g., cellular host
        with LAN capabilities as discussed in Section 4):

        *  If the requested IPv4v6 PDP-Context is not supported by the
           network, but IPv4 and IPv6 PDP types are allowed, then the
           cellular host will be configured with an IPv4 address or an
           IPv6 prefix by the network.  It MUST initiate another PDP-
           Context activation in addition to the one already activated
           for a given APN (Access Point Name).

        *  If the requested PDP type and subscription data allows only
           one IP address family (IPv4 or IPv6), the cellular host MUST
           NOT request a second PDP-Context to the same APN for the
           other IP address family.

        The text above focuses on the specification part which explains
        the behavior for requesting IPv6-related PDP-Context(s).
        Understanding this behavior is important to avoid having broken
        IPv6 implementations in cellular devices.






Binet, et al.            Expires March 15, 2014                 [Page 5]

Internet-Draft      IPv6 Profile for Cellular Devices     September 2013


   REQ#4:  The cellular host MUST support the PCO (Protocol
        Configuration Options) [TS.24008] to retrieve the IPv6
        address(es) of the Recursive DNS server(s).

           In-band signaling is a convenient method to inform the
           cellular host about various services, including DNS server
           information.  It does not require any specific protocol to be
           supported and it is already deployed in IPv4 cellular
           networks to convey such DNS information.

   REQ#5:  The cellular host MUST support IPv6 aware Traffic Flow
        Templates (TFT) [TS.24008].

           Traffic Flow Templates are employing a packet filter to
           couple an IP traffic with a PDP-Context.  Thus a dedicated
           PDP-Context and radio resources can be provided by the
           cellular network for certain IP traffic.

   REQ#6:  The device MUST support the Neighbor Discovery Protocol
        ([RFC4861] and [RFC5942]).

           This is a stronger form compared to what is specified in
           Section 5.2 and Section 12.2 of [RFC6434].

           The support of Neighbor Discovery Protocol is mandatory in
           3GPP cellular environment as it is the only way to convey
           IPv6 prefix towards the 3GPP cellular device.

           In particular, MTU (Maximum Transmission Unit) communication
           via Router Advertisement MUST be supported since many 3GPP
           networks do not have a standard MTU setting.

   REQ#7:  The cellular host MUST comply with Section 5.6.1 of
        [RFC6434].  If the MTU used by cellular hosts is larger than
        1280 bytes, they can rely on Path MTU discovery function to
        discover the real path MTU.

   REQ#8:  The cellular host MUST support IPv6 Stateless Address
        Autoconfiguration ([RFC4862]) apart from the exceptions noted in
        [TS.23060] (3G) and [TS.23401] (LTE):

           Stateless mode is the only way to configure a cellular host.
           The GGSN/PGW must allocate a prefix that is unique within its
           scope to each primary PDP-Context.

           To configure its link local address, the cellular host MUST
           use the Interface Identifier conveyed in 3GPP PDP-Context
           setup signaling received from a GGSN/PGW.  The cellular host



Binet, et al.            Expires March 15, 2014                 [Page 6]

Internet-Draft      IPv6 Profile for Cellular Devices     September 2013


           may use a different Interface Identifiers to configure its
           global addresses (see also REQ#23 about privacy addressing
           requirement).

           For more details, refer to [RFC6459] and
           [I-D.ietf-v6ops-rfc3316bis].

   REQ#9:  The cellular host MUST comply with Section 7.3 of [RFC6434].

   REQ#10:  The cellular host MUST comply with Section 7.2.1 of
        [RFC6434].

           Stateless DHCPv6 is useful to retrieve other information than
           DNS.

           If [RFC6106] is not supported at the network side, the
           cellular host SHOULD retrieve DNS information using stateless
           DHCPv6 [RFC3736].

   REQ#11:  If the cellular host receives the DNS information in several
        channels for the same interface, the following preference order
        MUST be followed:

        1.  PCO

        2.  RA

        3.  DHCPv6

   REQ#12:  The cellular host SHOULD support a method to locally
        construct IPv4-embedded IPv6 addresses [RFC6052].  A method to
        learn PREFIX64 SHOULD be supported by the cellular host.

           This solves the issue when applications use IPv4 referrals on
           IPv6-only access networks.

           In PCP-based environments, cellular hosts SHOULD follow
           [I-D.ietf-pcp-nat64-prefix64] to learn the IPv6 Prefix used
           by an upstream PCP-controlled NAT64 device.  If PCP is not
           enabled, the cellular host SHOULD implement the method
           specified in [I-D.ietf-behave-nat64-discovery-heuristic] to
           retrieve the PREFIX64.

   REQ#13:  The cellular host SHOULD implement the Customer Side
        Translator (CLAT, [RFC6877]) function which is compliant with
        [RFC6052][RFC6145][RFC6146].





Binet, et al.            Expires March 15, 2014                 [Page 7]

Internet-Draft      IPv6 Profile for Cellular Devices     September 2013


           CLAT function in the cellular host allows for IPv4-only
           application and IPv4-referals to work on an IPv6-only
           connectivity.  CLAT function requires a NAT64 capability
           [RFC6146] in the core network.

   REQ#14:  The cellular host SHOULD embed a DNS64 function [RFC6147].

           Local DNS64 functionality allows for compatibility with DNS
           Security Extensions (DNSSEC, [RFC4033], [RFC4034],
           [RFC4035]).  Means to configure or discover a PREFIX64 is
           also required on the cellular device as discussed in REQ#12.

   REQ#15:  The cellular host SHOULD support PCP [RFC6887].

           The support of PCP is seen as a driver to save battery
           consumption exacerbated by keepalive messages.  PCP also
           gives the possibility of enabling incoming connections to the
           cellular device.  Indeed, because several stateful devices
           may be deployed in wireless networks (e.g., NAT and/or
           Firewalls), PCP can be used by the cellular host to control
           network-based NAT and Firewall functions which will reduce
           per-application signaling and save battery consumption.

   REQ#16:  When the cellular host is dual-stack connected (i.e.,
        configured with an IPv4 address and IPv6 prefix), it SHOULD
        support means to prefer native IPv6 connection over connection
        established through translation devices (e.g., NAT44 and NAT64).

           When both IPv4 and IPv6 DNS servers are configured, a dual-
           stack host MUST contact first its IPv6 DNS server.

           Cellular hosts SHOULD follow the procedure specified in
           [RFC6724] for source address selection.

   REQ#17:  The cellular host SHOULD support Happy Eyeballs procedure
        defined in [RFC6555].

   REQ#18:  Because of potential operational deficiencies to be
        experienced in some roaming situations, the cellular host MUST
        be able to be configured with a home IP profile and a roaming IP
        profile.  The aim of the roaming profile is to limit the PDP
        type(s) requested by the cellular host when out of the home
        network.  Note, distinct PDP type(s) can be configured for home
        and roaming cases.

2.1.  WLAN Connectivity Requirements





Binet, et al.            Expires March 15, 2014                 [Page 8]

Internet-Draft      IPv6 Profile for Cellular Devices     September 2013


   It is increasingly common for cellular hosts have a WLAN interface in
   addition to their cellular interface.  These hosts are likely to be
   connected to private or public hotspots.  Below are listed some
   generic requirements:

   REQ#19:  IPv6 MUST be supported on the WLAN interface.  In
          particular, IPv6-only connectivity MUST be supported over the
          WLAN interface.

             Some tests revealed that IPv4 configuration is required to
             enable IPv6-only connectivity.  Indeed, some cellular
             handsets can access a WLAN IPv6-only network by configuring
             first a static IPv4 address.  Once the device is connected
             to the network and the wlan0 interface got an IPv6 global
             address, the IPv4 address can be deleted from the
             configuration.  This avoids the device to ask automatically
             for a DHCPv4 server, and allows to connect to IPv6-only
             networks.  Failing to configure an IPv4 address on the
             interface MUST NOT prohibit using IPv6 on the same
             interface.

             IPv6 Stateless Address Autoconfiguration ([RFC4862]) MUST
             be supported.

   REQ#20:  DHCPv6 client SHOULD be supported on WLAN interface.

             Refer to Section 7.2.1 of [RFC6434].

   REQ#21:  WLAN interface SHOULD support Router Advertisement Options
          for DNS configuration (See Section 7.3 of [RFC6434]).

   REQ#22:  If the device receives the DNS information in several
          channels for the same interface, the following preference
          order MUST be followed:

          1.  RA

          2.  DHCPv6

3.  Advanced Requirements

   REQ#23:  The cellular host MUST be able to generate IPv6 addresses
          which preserve privacy.

             The activation of privacy extension (e.g., using [RFC4941])
             makes it more difficult to track a host over time when
             compared to using a permanent Interface Identifier.  Note,
             [RFC4941] does not require any DAD mechanism to be



Binet, et al.            Expires March 15, 2014                 [Page 9]

Internet-Draft      IPv6 Profile for Cellular Devices     September 2013


             activated as the GGSN/PGW MUST NOT configure any global
             address based on the prefix allocated to the cellular host.

             Tracking a host is still possible based on the first 64
             bits of the IPv6 address.  Means to prevent against such
             tracking issues may be enabled in the network side.

             Privacy extensions are required by regulatory bodies in
             some countries.

   REQ#24:  The cellular host MUST support ROHC RTP Profile (0x0001) and
          ROHC UDP Profile (0x0002) for IPv6 ([RFC5795]).  Other ROHC
          profiles MAY be supported.

             Bandwidth in cellular networks must be optimized as much as
             possible.  ROHC provides a solution to reduce bandwidth
             consumption and to reduce the impact of having bigger
             packet headers in IPv6 compared to IPv4.

             "RTP/UDP/IP" ROHC profile (0x0001) to compress RTP packets
             and "UDP/IP" ROHC profile (0x0002) to compress RTCP packets
             are required for Voice over LTE (VoLTE) by IR.92.4.0
             section 4.1 [IR92].  Note, [IR92] indicates also the host
             must be able to apply the compression to packets that are
             carried over the radio bearer dedicated for the voice
             media.

   REQ#25:  The cellular host MUST comply with Section 5.3 of [RFC6434]
          and SHOULD support Router Advertisement extension for
          communicating default router preferences and more-specific
          routes as described in [RFC4191].

             This function can be used for instance for traffic offload.

4.  Cellular Devices with LAN Capabilities

   This section focuses on cellular devices (e.g., CPE, smartphones or
   dongles with tethering features) which provide IP connectivity to
   other devices connected to them.  In such case, all connected devices
   are sharing the same 2G, 3G or LTE connection.  In addition to the
   generic requirements listed in Section 2, these cellular devices have
   to meet the requirements listed below.

   REQ#26:  The cellular device MUST support Prefix Delegation
          capabilities [RFC3633] and MUST support Prefix Exclude Option
          for DHCPv6-based Prefix Delegation as defined in [RFC6603].
          Particularly, it MUST behave as a Requesting Router.




Binet, et al.            Expires March 15, 2014                [Page 10]

Internet-Draft      IPv6 Profile for Cellular Devices     September 2013


             Cellular networks are more and more perceived as an
             alternative to fixed networks for home IP-based services
             delivery; especially with the advent of smartphones and
             3GPP data dongles.  There is a need for an efficient
             mechanism to assign shorter prefix than /64 to cellular
             hosts so that each LAN segment can get its own /64 prefix
             and multi-link subnet issues to be avoided.

             In case a prefix is delegated to a cellular host using
             DHCPv6, the cellular device will be configured with two
             prefixes:

                (1) one for 3GPP link allocated using SLAAC mechanism
                and

                (2) another one delegated for LANs acquired during
                Prefix Delegation operation.

             Note that the 3GPP network architecture requires both the
             WAN (Wide Area Network) and the delegated prefix to be
             aggregatable, so the subscriber can be identified using a
             single prefix.

             Without the Prefix Exclude Option, the delegating router
             (GGSN/PGW) will have to ensure [RFC3633] compliancy (e.g.,
             halving the delegated prefix and assigning the WAN prefix
             out of the 1st half and the prefix to be delegated to the
             terminal from the 2nd half).

   REQ#27:  The cellular device MUST be compliant with the CPE
          requirements specified in [RFC6204].

             There are several deployments, particularly in emerging
             countries, that relies on mobile networks to provide
             broadband services (e.g., customers are provided with
             mobile CPEs).

   REQ#28:  For deployments requiring to share the same /64 prefix, the
          cellular device SHOULD support [I-D.ietf-v6ops-64share] to
          enable sharing a /64 prefix between the 3GPP interface towards
          the GGSN/PGW (WAN interface) and the LAN interfaces.

   REQ#29:  The cellular device SHOULD support the Customer Side
          Translator (CLAT) [RFC6877].

             Various IP devices are likely to be connected to cellular
             device, acting as a CPE.  Some of these devices can be
             dual-stack, others are IPv6-only or IPv4-only.  IPv6-only



Binet, et al.            Expires March 15, 2014                [Page 11]

Internet-Draft      IPv6 Profile for Cellular Devices     September 2013


             connectivity for cellular device does not allow IPv4-only
             sessions to be established for hosts connected on the LAN
             segment of cellular devices.

             In order to allow IPv4 sessions establishment initiated
             from devices located on LAN segment side and target IPv4
             nodes, a solution consists in integrating the CLAT function
             in the cellular device.  As elaborated in Section 2, the
             CLAT function allows also IPv4 applications to continue
             running over an IPv6-only host.

   REQ#30:  If a RA MTU is advertised from the 3GPP network, the
          cellular device SHOULD relay that upstream MTU information to
          the downstream attached LAN devices in RA.

             Receiving and relaying RA MTU values facilitates a more
             harmonious functioning of the mobile core network where end
             nodes transmit packets that do not exceed the MTU size of
             the mobile network's GTP tunnels.

             [TS.23060] indicates providing a link MTU value of 1358
             octets to the 3GPP cellular device will prevent the IP
             layer fragmentation within the transport network between
             the cellular device and the GGSN/PGW.

5.  APIs & Applications

   REQ#31:  Name resolution libraries MUST support both IPv4 and IPv6.

             In particular, the cellular host MUST support [RFC3596].

   REQ#32:  Applications provided by the mobile device vendor MUST be
          independent of the underlying IP address family.

             This means applications must be IP version agnostic.

   REQ#33:  Applications provided by the mobile device vendor that use
          URIs MUST follow [RFC3986].  For example, SIP applications
          MUST follow the correction defined in [RFC5954].

6.  Security Considerations

   The security considerations identified in [I-D.ietf-v6ops-rfc3316bis]
   and [RFC6459] are to be taken into account.

   Security-related considerations that apply when the cellular device
   provides LAN features are specified in [RFC6092].




Binet, et al.            Expires March 15, 2014                [Page 12]

Internet-Draft      IPv6 Profile for Cellular Devices     September 2013


7.  IANA Considerations

   This document does not require any action from IANA.

8.  Acknowledgements

   Many thanks to H. Soliman, H. Singh, L. Colliti, T. Lemon, B.
   Sarikaya, M. Mawatari, M. Abrahamsson, P. Vickers, V. Kuarsingh, N.
   Heatley, E. Kline, S. Josefsson, A. Baryun, and J. Woodyatt for the
   discussion in the v6ops mailing list.

   Special thanks to T. Savolainen and J. Korhonen for the detailed
   review.

9.  References

9.1.  Normative References

   [I-D.ietf-v6ops-rfc3316bis]
              Korhonen, J., Arkko, J., Savolainen, T., and S. Krishnan,
              "IPv6 for 3GPP Cellular Hosts", draft-ietf-v6ops-
              rfc3316bis-04 (work in progress), September 2013.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC2460]  Deering, S. and R. Hinden, "Internet Protocol, Version 6
              (IPv6) Specification", RFC 2460, December 1998.

   [RFC3261]  Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston,
              A., Peterson, J., Sparks, R., Handley, M., and E.
              Schooler, "SIP: Session Initiation Protocol", RFC 3261,
              June 2002.

   [RFC3596]  Thomson, S., Huitema, C., Ksinant, V., and M. Souissi,
              "DNS Extensions to Support IP Version 6", RFC 3596,
              October 2003.

   [RFC3633]  Troan, O. and R. Droms, "IPv6 Prefix Options for Dynamic
              Host Configuration Protocol (DHCP) version 6", RFC 3633,
              December 2003.

   [RFC3736]  Droms, R., "Stateless Dynamic Host Configuration Protocol
              (DHCP) Service for IPv6", RFC 3736, April 2004.

   [RFC3986]  Berners-Lee, T., Fielding, R., and L. Masinter, "Uniform
              Resource Identifier (URI): Generic Syntax", STD 66, RFC
              3986, January 2005.



Binet, et al.            Expires March 15, 2014                [Page 13]

Internet-Draft      IPv6 Profile for Cellular Devices     September 2013


   [RFC4191]  Draves, R. and D. Thaler, "Default Router Preferences and
              More-Specific Routes", RFC 4191, November 2005.

   [RFC4861]  Narten, T., Nordmark, E., Simpson, W., and H. Soliman,
              "Neighbor Discovery for IP version 6 (IPv6)", RFC 4861,
              September 2007.

   [RFC4862]  Thomson, S., Narten, T., and T. Jinmei, "IPv6 Stateless
              Address Autoconfiguration", RFC 4862, September 2007.

   [RFC4941]  Narten, T., Draves, R., and S. Krishnan, "Privacy
              Extensions for Stateless Address Autoconfiguration in
              IPv6", RFC 4941, September 2007.

   [RFC5795]  Sandlund, K., Pelletier, G., and L-E. Jonsson, "The RObust
              Header Compression (ROHC) Framework", RFC 5795, March
              2010.

   [RFC5942]  Singh, H., Beebee, W., and E. Nordmark, "IPv6 Subnet
              Model: The Relationship between Links and Subnet
              Prefixes", RFC 5942, July 2010.

   [RFC5954]  Gurbani, V., Carpenter, B., and B. Tate, "Essential
              Correction for IPv6 ABNF and URI Comparison in RFC 3261",
              RFC 5954, August 2010.

   [RFC6052]  Bao, C., Huitema, C., Bagnulo, M., Boucadair, M., and X.
              Li, "IPv6 Addressing of IPv4/IPv6 Translators", RFC 6052,
              October 2010.

   [RFC6106]  Jeong, J., Park, S., Beloeil, L., and S. Madanapalli,
              "IPv6 Router Advertisement Options for DNS Configuration",
              RFC 6106, November 2010.

   [RFC6145]  Li, X., Bao, C., and F. Baker, "IP/ICMP Translation
              Algorithm", RFC 6145, April 2011.

   [RFC6146]  Bagnulo, M., Matthews, P., and I. van Beijnum, "Stateful
              NAT64: Network Address and Protocol Translation from IPv6
              Clients to IPv4 Servers", RFC 6146, April 2011.

   [RFC6147]  Bagnulo, M., Sullivan, A., Matthews, P., and I. van
              Beijnum, "DNS64: DNS Extensions for Network Address
              Translation from IPv6 Clients to IPv4 Servers", RFC 6147,
              April 2011.

   [RFC6434]  Jankiewicz, E., Loughney, J., and T. Narten, "IPv6 Node
              Requirements", RFC 6434, December 2011.



Binet, et al.            Expires March 15, 2014                [Page 14]

Internet-Draft      IPv6 Profile for Cellular Devices     September 2013


   [RFC6555]  Wing, D. and A. Yourtchenko, "Happy Eyeballs: Success with
              Dual-Stack Hosts", RFC 6555, April 2012.

   [RFC6603]  Korhonen, J., Savolainen, T., Krishnan, S., and O. Troan,
              "Prefix Exclude Option for DHCPv6-based Prefix
              Delegation", RFC 6603, May 2012.

   [RFC6724]  Thaler, D., Draves, R., Matsumoto, A., and T. Chown,
              "Default Address Selection for Internet Protocol Version 6
              (IPv6)", RFC 6724, September 2012.

9.2.  Informative References

   [I-D.ietf-behave-nat64-discovery-heuristic]
              Savolainen, T., Korhonen, J., and D. Wing, "Discovery of
              the IPv6 Prefix Used for IPv6 Address Synthesis", draft-
              ietf-behave-nat64-discovery-heuristic-17 (work in
              progress), April 2013.

   [I-D.ietf-pcp-nat64-prefix64]
              Boucadair, M., "Learning NAT64 PREFIX64s using PCP",
              draft-ietf-pcp-nat64-prefix64-04 (work in progress), July
              2013.

   [I-D.ietf-v6ops-64share]
              Byrne, C., Drown, D., and V. Ales, "Extending an IPv6 /64
              Prefix from a 3GPP Mobile Interface to a LAN link", draft-
              ietf-v6ops-64share-08 (work in progress), July 2013.

   [IR92]     GSMA, "IR.92.V4.0 - IMS Profile for Voice and SMS", March
              2011, <http://www.gsma.com/newsroom/ir-92-v4-0-ims-
              profile-for-voice-and-sms>.

   [RFC4033]  Arends, R., Austein, R., Larson, M., Massey, D., and S.
              Rose, "DNS Security Introduction and Requirements", RFC
              4033, March 2005.

   [RFC4034]  Arends, R., Austein, R., Larson, M., Massey, D., and S.
              Rose, "Resource Records for the DNS Security Extensions",
              RFC 4034, March 2005.

   [RFC4035]  Arends, R., Austein, R., Larson, M., Massey, D., and S.
              Rose, "Protocol Modifications for the DNS Security
              Extensions", RFC 4035, March 2005.







Binet, et al.            Expires March 15, 2014                [Page 15]

Internet-Draft      IPv6 Profile for Cellular Devices     September 2013


   [RFC6092]  Woodyatt, J., "Recommended Simple Security Capabilities in
              Customer Premises Equipment (CPE) for Providing
              Residential IPv6 Internet Service", RFC 6092, January
              2011.

   [RFC6204]  Singh, H., Beebee, W., Donley, C., Stark, B., and O.
              Troan, "Basic Requirements for IPv6 Customer Edge
              Routers", RFC 6204, April 2011.

   [RFC6459]  Korhonen, J., Soininen, J., Patil, B., Savolainen, T.,
              Bajko, G., and K. Iisakkila, "IPv6 in 3rd Generation
              Partnership Project (3GPP) Evolved Packet System (EPS)",
              RFC 6459, January 2012.

   [RFC6877]  Mawatari, M., Kawashima, M., and C. Byrne, "464XLAT:
              Combination of Stateful and Stateless Translation", RFC
              6877, April 2013.

   [RFC6887]  Wing, D., Cheshire, S., Boucadair, M., Penno, R., and P.
              Selkirk, "Port Control Protocol (PCP)", RFC 6887, April
              2013.

   [TS.23060]
              3GPP, "General Packet Radio Service (GPRS); Service
              description; Stage 2", September 2011.

   [TS.23401]
              3GPP, "General Packet Radio Service (GPRS) enhancements
              for Evolved Universal Terrestrial Radio Access Network
              (E-UTRAN) access", September 2011.

   [TS.23402]
              3GPP, "Architecture enhancements for non-3GPP accesses",
              September 2011.

   [TS.24008]
              3GPP, "Mobile radio interface Layer 3 specification; Core
              network protocols; Stage 3", June 2011.

   [TS.29060]
              3GPP, "General Packet Radio Service (GPRS); GPRS
              Tunnelling Protocol (GTP) across the Gn and Gp interface",
              September 2011.

   [TS.29274]
              3GPP, "3GPP Evolved Packet System (EPS); Evolved General
              Packet Radio Service (GPRS) Tunnelling Protocol for
              Control plane (GTPv2-C); Stage 3", June 2011.



Binet, et al.            Expires March 15, 2014                [Page 16]

Internet-Draft      IPv6 Profile for Cellular Devices     September 2013


   [TS.29281]
              3GPP, "General Packet Radio System (GPRS) Tunnelling
              Protocol User Plane (GTPv1-U)", September 2011.

Authors' Addresses

   David Binet
   France Telecom
   Rennes
   France

   EMail: david.binet@orange.com


   Mohamed Boucadair
   France Telecom
   Rennes  35000
   France

   EMail: mohamed.boucadair@orange.com


   Ales Vizdal
   Deutsche Telekom AG

   EMail: ales.vizdal@t-mobile.cz


   Cameron Byrne
   T-Mobile
   USA

   EMail: Cameron.Byrne@T-Mobile.com


   Gang Chen
   China Mobile

   EMail: phdgang@gmail.com












Binet, et al.            Expires March 15, 2014                [Page 17]
